app/Http/Controllers/Traits/DataTablesFilterTrait.php

    public function travelFilterMount(){
                // Form filters
                $countries = Country::get(['id', 'name']);
                $cities    = collect();
                $genders = Patient::GENDER_SELECT;
                $bloodGroups = Patient::BLOOD_GROUP_SELECT;
                $refferingTypes = Travel::REFFERING_TYPE_SELECT;
                $campaignChannels = CampaignChannel::get(['id', 'title']); //->pluck('title', 'id');
                $campaignOrganizations = collect();
                $statuses = TravelStatus::orderBy('ordering', 'desc')->get(['id', 'title'])->pluck('title', 'id');
                $departments = Department::get(['id', 'name'])->pluck('name', 'id');
                $notify_hospitals = Hospital::get(['id', 'name'])->pluck('name', 'id');
                $translators = Translator::get(['id', 'title'])->pluck('title', 'id');
---
select `id`, `name` from `countries` where `countries`.`deleted_at` is null
select `id`, `title` from `campaign_channels` where `campaign_channels`.`deleted_at` is null
select `id`, `title` from `travel_statuses` where `travel_statuses`.`deleted_at` is null order by `ordering` desc
select `id`, `name` from `departments` where `departments`.`deleted_at` is null
select `id`, `name` from `hospitals` where `hospitals`.`deleted_at` is null
select `id`, `title` from `translators` where `translators`.`deleted_at` is null

    public function crmMountFilter(){
        // Mount Data for Form filters
        $countries = Country::get(['id', 'name']);
        $cities    = collect();
        $campaignChannels = CampaignChannel::get(['id', 'title']); //->pluck('title', 'id');
        $campaignOrganizations = collect();
        $statuses = CrmStatus::get(['id', 'name'])->pluck('name', 'id');
---
select `id`, `name` from `countries` where `countries`.`deleted_at` is null
select `id`, `title` from `campaign_channels` where `campaign_channels`.`deleted_at` is null
select `id`, `name` from `crm_statuses`