app/Helpers/UtilsHelper.php

select `short_code`, `code_inc` from `countries` where `id` = 1 and `countries`.`deleted_at` is null limit 1
---
    function generateCode($countryId)
    {

        $country = Country::where('id', $countryId)->first(['short_code', 'code_inc']);