app/Livewire/Travel.php

select `id`, `title` from `campaign_channels` where `campaign_channels`.`deleted_at` is null
select `id`, `title` from `travel_statuses` where `travel_statuses`.`deleted_at` is null order by `ordering` desc
select `id`, `name` from `departments` where `departments`.`deleted_at` is null
select `id`, `title` from `travel_hospitals` where `travel_hospitals`.`deleted_at` is null
select `id`, `title` from `translators` where `translators`.`deleted_at` is null
---
    public function mount()
    {
        Log::info('Travel Add Mount');
        $this->countries = Country::get(['id', 'name']);
        $this->cities    = collect();
        $this->countryId = 1;

        // Set default country and Generate Code
        $this->updatedCountryId($this->countryId);

        $this->city_id = null;

        $this->genders = Patient::GENDER_SELECT;
        $this->bloodGroups = Patient::BLOOD_GROUP_SELECT;
        $this->refferingTypes = ModelsTravel::REFFERING_TYPE_SELECT;

        $this->campaignChannels = CampaignChannel::get(['id', 'title']); //->pluck('title', 'id');
        $this->campaignOrganizations = collect();
        $this->compaignChannelId = null;
        $this->campaign_org_id = null;

        $this->statuses = TravelStatus::orderBy('ordering', 'desc')->get(['id', 'title'])->pluck('title', 'id');

        $this->departments = Department::get(['id', 'name'])->pluck('name', 'id');
        $this->department_id = null;

        $this->status_id = $this->last_status_id = null;

        $this->notify_hospitals = TravelHospital::get(['id', 'title'])->pluck('title', 'id');
        $this->notifyHospitalIds = [];
        $this->translators = Translator::get(['id', 'title'])->pluck('title', 'id');

select `id`, `name` from `provinces` where `country_id` = 1 and `provinces`.`deleted_at` is null
---
    public function updatedCountryId($value)
    {
        if ($value != 'null' && $value != null) {
            $this->cities = Province::where('country_id', $value)->get(['id', 'name']);