app/Http/Controllers/Admin/CrmCustomerController.php

    public function show(CrmCustomer $crmCustomer)
    {
        abort_if(Gate::denies('crm_customer_show'), Response::HTTP_FORBIDDEN, '403 Forbidden');

        $statuses = CrmStatus::pluck('name', 'id')->prepend(trans('global.pleaseSelect'), '');


        $crmCustomer->load('status', 'city', 'campaign', 'user', 'customerCrmDocuments');
---
select `name`, `id` from `crm_statuses`
select * from `crm_documents` where `crm_documents`.`customer_id` in (2199) and `crm_documents`.`deleted_at` is null
select * from `crm_statuses` where `crm_statuses`.`id` in (3)
select * from `users` where `users`.`id` in (17) and `users`.`deleted_at` is null