app/Http/Controllers/Admin/CrmDocumentController.php

    public function ajaxShow(CrmDocument $crmDocument)
    {
        abort_if(Gate::denies('crm_document_edit'), Response::HTTP_FORBIDDEN, '403 Forbidden');

        $crmDocument->load('status');
---
select * from `crm_statuses` where `crm_statuses`.`id` in (3)