app/Http/Controllers/Admin/DoctorController.php

            return $table->make(true);
        }

        $cities = Province::pluck('name', 'id')->prepend(trans('global.pleaseSelect'), '');

        $hospitals = Hospital::pluck('name', 'id')->prepend(trans('global.pleaseSelect'), '');

        $departments = Department::pluck('name', 'id')->prepend(trans('global.pleaseSelect'), '');
---
select `name`, `id` from `provinces` where `provinces`.`deleted_at` is null
select `name`, `id` from `hospitals` where `hospitals`.`deleted_at` is null
select `name`, `id` from `departments` where `departments`.`deleted_at` is null