app/Http/Controllers/Admin/TravelController.php

select * from `activities` where `activities`.`travel_id` in (6953) and `activities`.`deleted_at` is null
select * from `departments` where `departments`.`id` in (16) and `departments`.`deleted_at` is null
select * from `hospitals` where `hospitals`.`id` in (1) and `hospitals`.`deleted_at` is null
select * from `patients` where `patients`.`id` in (7236) and `patients`.`deleted_at` is null
---
    public function show(Travel $travel)
    {
        abort_if(Gate::denies('travel_show'), Response::HTTP_FORBIDDEN, '403 Forbidden');

        $travel->load('patient', 'group', 'hospital', 'department', 'status', 'travelTravelTreatmentActivities', 'travelActivities');